taboadaa/ShuQi/nRF/Packages/.cache/GigaDevice.GD32F1x0_DFP.3.0.2.pdsc
  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="OPA" Cversion="3.0.1" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Operational Amplifiers (OPA) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_OPA
        </RTE_Components_h>
        <files>
          <!-- OPAMP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_opa.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_opa.c" attr="config" version="3.0.1" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F1x0_StdPeripherals" Csub="IVREF" Cversion="3.0.1" condition="GD32F1x0 STDPERIPHERALS RCU">
      <description>Programmable Current and Voltage Reference (IVREF) driver for GD32F1x0 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_IVREF
        </RTE_Components_h>
        <files>
          <!-- IVREF flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f1x0_ivref.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f1x0_ivref.c" attr="config" version="3.0.1" />
        </files>
    </component>

    <!-- Utilities GD32F1x0 -->
    <component Cclass="Device" Cgroup="GD32F1x0_EVAL" Cversion="3.0.1" condition="GD32F1x0 STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f1x0_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f1x0_eval.c" attr="config" version="3.0.1"/>
      </files>
    </component>

    <!-- Config GD32F1x0 -->
    <component Cclass="Device" Cgroup="GD32F1x0_libopt" Cversion="3.0.1" condition="GD32F1x0 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Template/gd32f1x0_libopt.h"/>
      </files>
    </component>

    <!-- Startup GD32F1x0 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.0.1" condition="GD32F1x0 CMSIS">
      <description>System Startup for GigaDevice GD32F1x0 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f1x0.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f1x0.s" attr="config" version="3.0.1" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f1x0.c"      attr="config" version="3.0.1"/>
      </files>
    </component>

    <!-- GD32150C-START Board Support -->
    <bundle Cbundle="GD32150C-START" Cclass="Board Support" Cversion="3.0.1">
      <description>GigaDevice GD32150C-START Board Support</description>
      <doc></doc>
      <component Cgroup="LED" condition="GD32F1x0 CMSIS">
      <description>LED driver for GigaDevice GD32150C-START Board</description>
        <files>
          <file category="source" name="Boards/GigaDevice/GD32150C-START/Common/LED.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="GD32F1x0 CMSIS">
      <description>Button driver for GigaDevice GD32150C-START Board</description>
        <files>
          <file category="source" name="Boards/GigaDevice/GD32150C-START/Common/Buttons.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="GigaDevice" name="GD32150C-START" revision="Rev. A" salesContact="http://www.gigadevice.com/page/id-65.html">
      <description>GigaDevice GD32150C-START Board</description>
      <book category="overview"  name="http://www.gigadevice.com"  title="GD32150C -START Board"/>
      <book category="schematic" name="Boards/GigaDevice/GD32150C-START/Documents/GD32150C-START.pdf" title="GD32150C-START Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="GigaDevice:123" Dname="GD32F150C8"/>
      <compatibleDevice deviceIndex="0" Dvendor="GigaDevice:123" DsubFamily="GD32F150"/>
      <feature type="XTAL"       n="8000000"/>
      <feature type="PWR"         n="2.6" m="3.6"              name="Power Supply"/>
      <feature type="LED"         n="3"                               name="LEDs: Power, 2 x User"/>
      <feature type="Button"     n="2"                               name="Push-buttons: User and Reset"/>
    </board>
  </boards>

  <examples>
    <!-- GD32150C-START Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/GigaDevice/GD32150C-START/Blinky">
      <description>Blinky example</description>
      <board name="GD32150C-START" vendor="GigaDevice"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/GigaDevice/GD32150C-START/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="GD32150C-START" vendor="GigaDevice"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>
</package>
